<template>
  <v-dialog v-model="dialog" scrollable width="500">
    <!-- 약관 -->
    <v-card v-if="this.type === 'terms'">
      <v-card-title class="text-h5 lighten-2"> 약관 </v-card-title>
      <v-card-text class="dialog-height">
        챌림픽 서비스 및 제품(이하 ‘서비스’)을 이용해 주셔서 감사합니다. 본
        약관은 다양한 챌림픽 서비스의 이용과 관련하여 챌림픽 서비스를 제공하는
        챌림픽 주식회사(이하 ‘챌림픽’)와 이를 이용하는 챌림픽 서비스 회원(이하
        ‘회원’) 또는 비회원과의 관계를 설명하며, 아울러 여러분의 챌리픽 서비스
        이용에 도움이 될 수 있는 유익한 정보를 포함하고 있습니다. 챌림픽
        서비스를 이용하시거나 챌림픽 서비스 회원으로 가입하실 경우 여러분은 본
        약관 및 관련 운영 정책을 확인하거나 동의하게 되므로, 잠시 시간을 내시어
        주의 깊게 살펴봐 주시기 바랍니다. 다양한 챌림픽 서비스를 즐겨보세요.
        <br />
        <br />
        챌림픽은 챌림픽 웹사이트를 통해 정보 검색, 다른 이용자와의 커뮤니케이션,
        콘텐츠 제공 등 여러분의 생활에 편리함을 더할 수 있는 다양한 서비스를
        제공하고 있습니다. 여러분은 PC, 휴대폰 등 인터넷 이용이 가능한 각종
        단말기를 통해 각양각색의 챌림픽 서비스를 자유롭게 이용하실 수 있으며,
        개별 서비스들의 구체적인 내용은 각 서비스 상의 안내에서 쉽게 확인하실 수
        있습니다. 회원으로 가입하시면 챌림픽 서비스를 보다 편리하게 이용할 수
        있습니다.
        <br />
        <br />
        여러분은 본 약관을 읽고 동의하신 후 회원 가입을 신청하실 수 있으며,
        ‘챌림픽’ 이에 대한 승낙을 통해 회원 가입 절차를 완료하고 여러분께 챌림픽
        서비스 이용 계정(이하 ‘계정’)을 부여합니다. 계정이란 회원이 챌림픽
        서비스에 로그인한 이후 이용하는 각종 서비스 이용 이력을 회원 별로
        관리하기 위해 설정한 회원 식별 단위를 말합니다. 회원은 자신의 계정을
        통해 좀더 다양한 챌림픽 서비스를 보다 편리하게 이용할 수 있습니다. 이와
        관련한 상세한 내용은 챌림픽 개인정보 처리에서 확인해 주세요. 여러분이
        제공한 콘텐츠를 소중히 다룰 것입니다.
        <br />
        <br />
        챌림픽은 여러분이 자신이 제공한 콘텐츠에 대한 챌림픽 또는 다른
        이용자들의 이용 또는 접근을 보다 쉽게 관리할 수 있도록 다양한 수단을
        제공하기 위해 노력하고 있습니다. 여러분은 챌림픽 서비스 내에 콘텐츠
        삭제하여 직접 타인의 이용 또는 접근을 통제할 수 있습니다. 여러분의
        개인정보를 소중히 보호합니다.
        <br />
        <br />
        챌림픽은 서비스의 원활한 제공을 위하여 회원이 동의한 목적과 범위
        내에서만 개인정보를 수집∙이용하며, 개인정보 보호 관련 법령에 따라
        안전하게 관리합니다. 챌림픽이 이용자 및 회원에 대해 관련 개인정보를
        안전하게 처리하기 위하여 기울이는 노력이나 기타 상세한 사항은 개인정보
        처리방침에서 확인하실 수 있습니다. 챌림픽은 여러분이 서비스를 이용하기
        위해 일정 기간 동안 로그인 혹은 접속한 기록이 없는 경우, 전자메일,
        서비스 내 알림 또는 기타 적절한 전자적 수단을 통해 사전에 안내해 드린 후
        여러분의 정보를 파기하거나 분리 보관할 수 있으며, 만약 이로 인해 서비스
        제공을 위해 필수적인 정보가 부족해질 경우 부득이 관련 서비스 이용계약을
        해지할 수 있습니다. 타인의 권리를 존중해 주세요.
        <br />
        <br />
        챌림픽 수시로 본 약관, 계정 및 게시물 운영정책을 개정할 수 있습니다만,
        관련 법령을 위배하지 않는 범위 내에서 개정할 것이며, 사전에 그 개정
        이유와 적용 일자를 서비스 내에 알리도록 하겠습니다. 또한 여러분에게
        불리할 수 있는 중대한 내용의 약관 변경의 경우에는 최소 30일 이전에 해당
        서비스 내 공지하고 별도의 전자적 수단(전자메일, 서비스 내 알림 등)을
        통해 개별적으로 알릴 것입니다. 챌림픽은 변경된 약관을 게시한 날로부터
        효력이 발생되는 날까지 약관 변경에 대한 여러분의 의견을 기다립니다. 위
        기간이 지나도록 여러분의 의견이 챌림픽에 접수되지 않으면, 여러분이
        변경된 약관에 따라 서비스를 이용하는 데에 동의하는 것으로 간주됩니다.
        챌림픽로서는 매우 안타까운 일이지만, 여러분이 변경된 약관에 동의하지
        않는 경우 변경된 약관의 적용을 받는 해당 서비스의 제공이 더 이상
        불가능하게 될 수 있습니다. 챌림픽 서비스에는 기본적으로 본 약관이
        적용됩니다만, 부득이 각 개별 서비스의 고유한 특성을 반영하기 위해 본
        약관 외 별도의 약관, 운영정책이 추가로 적용될 때가 있습니다. 따라서
        별도의 약관, 운영정책에서 그 개별 서비스 제공에 관하여 본 약관, 계정 및
        게시물 운영정책과 다르게 정한 경우에는 별도의 약관, 운영정책이 우선하여
        적용됩니다. 이러한 내용은 각각의 개별 서비스 초기 화면에서 확인해 주시기
        바랍니다. 본 약관은 한국어를 정본으로 합니다. 본 약관 또는 챌림픽
        서비스와 관련된 여러분과 챌림픽과의 관계에는 대한민국의 법령이
        적용됩니다. 그리고 본 약관 또는 챌림픽 서비스와 관련하여 여러분과 챌림픽
        사이에 분쟁이 발생할 경우, 그 분쟁의 처리는 대한민국 '민사소송법'에서
        정한 절차를 따릅니다.
        <br />
        <br />
        공지 일자: 2022년 2월 7일
        <br />
        적용 일자: 2022년 2월 14일
        <br />
        <br />
        챌림픽 서비스와 관련하여 궁금하신 사항이 있으시면 고객센터(대표번호:
        042-820-7385)로 문의 주시기 바랍니다.
      </v-card-text>
      <v-divider></v-divider>
      <v-card-actions>
        <v-spacer></v-spacer>
        <v-btn color="#3396F4" text large @click="dialog = false"> 확인 </v-btn>
      </v-card-actions>
    </v-card>

    <!-- 개인정보처리방침 -->
    <v-card v-else-if="this.type === 'privacy'">
      <v-card-title class="text-h5 lighten-2"> 개인정보처리방침 </v-card-title>
      <v-card-text class="dialog-height">
        개인정보보호법에 따라 챌림픽에 회원가입 신청하시는 분께 수집하는
        개인정보의 항목, 개인정보의 수집 및 이용목적, 개인정보의 보유 및
        이용기간, 동의 거부권 및 동의 거부 시 불이익에 관한 사항을 안내 드리오니
        자세히 읽은 후 동의하여 주시기 바랍니다.
        <br />
        <br />
        1. 수집하는 개인정보
        <br />
        이용자는 회원가입을 하지 않아도 대부분의 챌림픽 서비스를 회원과 동일하게
        이용할 수 있습니다. 이용자가 회원가입을 할 경우, 챌림픽은 서비스 이용을
        위해 필요한 최소한의 개인정보를 수집합니다. 회원가입 시점에 챌림픽이
        이용자로부터 수집하는 개인정보는 아래와 같습니다. - 회원 가입 시에
        ‘이메일 주소, 비밀번호, 별명’을 필수항목으로 수집합니다. 서비스 이용
        과정에서 이용자로부터 수집하는 개인정보는 아래와 같습니다. - 회원정보
        또는 개별 서비스에서 프로필 정보(별명, 프로필 사진)를 설정할 수
        있습니다. 챌림픽 내의 개별 서비스 이용, 이벤트 응모 및 경품 신청
        과정에서 해당 서비스의 이용자에 한해 추가 개인정보 수집이 발생할 수
        있습니다. 추가로 개인정보를 수집할 경우에는 해당 개인정보 수집 시점에서
        이용자에게 ‘수집하는 개인정보 항목, 개인정보의 수집 및 이용목적,
        개인정보의 보관기간’에 대해 안내 드리고 동의를 받습니다. 서비스 이용
        과정에서 IP 주소, 쿠키, 서비스 이용 기록, 기기정보, 위치정보가 생성되어
        수집될 수 있습니다. 구체적으로 1) 서비스 이용 과정에서 이용자에 관한
        정보를 자동화된 방법으로 생성하여 이를 저장(수집)하거나, 2) 이용자
        기기의 고유한 정보를 원래의 값을 확인하지 못 하도록 안전하게 변환하여
        수집합니다. 이와 같이 수집된 정보는 개인정보와의 연계 여부 등에 따라
        개인정보에 해당할 수 있고, 개인정보에 해당하지 않을 수도 있습니다.
        <br />
        <br />
        2. 수집한 개인정보의 이용
        <br />
        챌림픽 및 챌림픽 관련 제반 서비스(모바일 웹/앱 포함)의 회원관리, 서비스
        개발・제공 및 향상, 안전한 인터넷 이용환경 구축 등 아래의 목적으로만
        개인정보를 이용합니다. - 콘텐츠 등 기존 서비스 제공(광고 포함)에 더하여,
        인구통계학적 분석, 서비스 방문 및 이용기록의 분석, 개인정보 및 관심에
        기반한 이용자간 관계의 형성, 관심사 등에 기반한 맞춤형 서비스 제공 등
        신규 서비스 요소의 발굴 및 기존 서비스 개선 등을 위하여 개인정보를
        이용합니다. - 이벤트 정보 및 참여기회 제공, 광고성 정보 제공 등 마케팅
        및 프로모션 목적으로 개인정보를 이용합니다. - 서비스 이용기록과 접속
        빈도 분석, 서비스 이용에 대한 통계, 서비스 분석 및 통계에 따른 맞춤
        서비스 제공 및 광고 게재 등에 개인정보를 이용합니다. - 보안, 프라이버시,
        안전 측면에서 이용자가 안심하고 이용할 수 있는 서비스 이용환경 구축을
        위해 개인정보를 이용합니다.
        <br />
        <br />
        3. 개인정보의 보관기간
        <br />
        회사는 원칙적으로 이용자의 개인정보를 회원 탈퇴 시 지체없이 파기하고
        있습니다. 단, 이용자에게 개인정보 보관기간에 대해 별도의 동의를 얻은
        경우, 또는 법령에서 일정 기간 정보보관 의무를 부과하는 경우에는 해당
        기간 동안 개인정보를 안전하게 보관합니다. 이용자에게 개인정보 보관기간에
        대해 회원가입 시 또는 서비스 가입 시 동의를 얻은 경우는 아래와 같습니다.
        - 부정 가입 및 이용 방지 부정 이용자의 가입인증 DI : 탈퇴일로부터 6개월
        보관 암호화처리(해시처리)한DI :혜택 제공 종료일로부터6개월 보관 이메일 :
        서비스 탈퇴 후 6개월 보관 참고로 챌림픽은 ‘개인정보 유효기간제’에 따라
        1년간 서비스를 이용하지 않은 회원의 개인정보를 별도로 분리 보관하여
        관리하고 있습니다.
        <br />
        <br />
        4. 개인정보 수집 및 이용 동의를 거부할 권리
        <br />
        이용자는 개인정보의 수집 및 이용 동의를 거부할 권리가 있습니다. 회원가입
        시 수집하는 최소한의 개인정보, 즉, 필수 항목에 대한 수집 및 이용 동의를
        거부하실 경우, 회원가입이 어려울 수 있습니다.
      </v-card-text>
      <v-divider></v-divider>
      <v-card-actions>
        <v-spacer></v-spacer>
        <v-btn color="#3396F4" text large @click="dialog = false"> 확인 </v-btn>
      </v-card-actions>
    </v-card>

    <!-- 위치 -->
    <v-card v-else>
      <v-card-title class="text-h5 lighten-2"> 위치 </v-card-title>
      <v-card-text class="dialog-height">
        <v-row class="location-wrapper">
          <img
            src="https://user-images.githubusercontent.com/53832553/152742986-2276bfa2-b111-451b-9b54-8ec3a6620d60.png"
          />
          <br />
          대전 캠퍼스 (삼성화재 유성연수원)
          <br />
          대표전화 : 042-820-7385
          <br />
          주소 : 대전광역시 유성구 동서대로 98-39
        </v-row>
      </v-card-text>
      <v-divider></v-divider>
      <v-card-actions>
        <v-spacer></v-spacer>
        <v-btn color="#3396F4" text large @click="dialog = false"> 확인 </v-btn>
      </v-card-actions>
    </v-card>
  </v-dialog>
</template>

<script>
export default {
  data() {
    return {
      dialog: true,
    };
  },
  props: {
    type: String,
  },
};
</script>

<style scoped>
.dialog-height {
  height: 300px;
}
.location-wrapper {
  font-size: 16px;
  align-content: center;
  justify-content: center;
  margin-top: 10px;
}
.v-card__text::-webkit-scrollbar-track {
  -webkit-box-shadow: inset 0 0 6px #5d5d5d;
  background-color: #5d5d5d;
}
.v-card__text::-webkit-scrollbar {
  width: 0px;
}
.v-card__text::-webkit-scrollbar-thumb {
  -webkit-box-shadow: inset 0 0 6px #424242;
  background-color: #424242;
}
</style>
